Revit 2024 API
OverrideGraphicSettings.SetProjectionLineWeight Method
 Sets the projection surface line weight.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public OverrideGraphicSettings SetProjectionLineWeight(
	int lineWeight
)
Visual Basic
Public Function SetProjectionLineWeight ( _
	lineWeight As Integer _
) As OverrideGraphicSettings
Visual C++
public:
OverrideGraphicSettings^ SetProjectionLineWeight(
	int lineWeight
)
Parameters
lineWeight
Type: System.Int32
 Value of the projection surface line weight for the override. InvalidPenNumber means no override is set.
Return Value
 Reference to the changed object.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Line weight must be a positive integer less than 17 or invalidPenNumber.
See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace